# Lesson 04 Task: SQL Basics (Track A)

## Database Applications Development

---

## Instructions

Complete all exercises below. Write SQL queries to answer each question.

**Resources:**
- Keep `SQL_Reference_Guide.md` open
- Review `dbApps04_Walkthrough.ipynb` for examples
- Ask for help if stuck!

**Submission:**
- Complete all TODO sections
- Test that all your queries run without errors
- Push to GitHub: `databaseApplications/dbApps04_Task_TrackA.ipynb`

Let's practice SQL! ðŸš€

---

## Setup

In [1]:
import pandas as pd
import sqlite3

# Connect to database
conn = sqlite3.connect('titanic.db')
print("âœ… Connected to database")

âœ… Connected to database

---

## Part 1: SELECT Basics (5 queries)

Practice selecting specific columns.

### Query 1: Select All Columns

**Task:** Write a query to select ALL columns from the passengers table. Limit to 5 rows.

In [2]:
# TODO: Write your query here
query_1 = """
SELECT * 
FROM passengers 
LIMIT 5
"""

result_1 = pd.read_sql(query_1, conn)
display(result_1)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"

### Query 2: Select Name and Age

**Task:** Select only the Name and Age columns. Show first 10 rows.

In [3]:
# TODO: Write your query
query_2 = """
SELECT Name, Age
FROM passengers 
LIMIT 10
"""

result_2 = pd.read_sql(query_2, conn)
display(result_2)

                                              name    age
0                    Allen, Miss. Elisabeth Walton  29.00
1                   Allison, Master. Hudson Trevor   0.92
2                     Allison, Miss. Helen Loraine   2.00
3             Allison, Mr. Hudson Joshua Creighton  30.00
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00
5                              Anderson, Mr. Harry  48.00
6                Andrews, Miss. Kornelia Theodosia  63.00
7                           Andrews, Mr. Thomas Jr  39.00
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00
9                          Artagaveytia, Mr. Ramon  71.00

### Query 3: Select Multiple Columns

**Task:** Select Name, Age, Sex, and Survived columns. Show first 10 rows.

In [4]:
# TODO: Write your query
query_3 = """
SELECT Name, Age, Sex, Survived
FROM passengers
LIMIT 10
"""

result_3 = pd.read_sql(query_3, conn)
display(result_3)

                                              name    age     sex  survived
0                    Allen, Miss. Elisabeth Walton  29.00  female         1
1                   Allison, Master. Hudson Trevor   0.92    male         1
2                     Allison, Miss. Helen Loraine   2.00  female         0
3             Allison, Mr. Hudson Joshua Creighton  30.00    male         0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00  female         0
5                              Anderson, Mr. Harry  48.00    male         1
6                Andrews, Miss. Kornelia Theodosia  63.00  female         1
7                           Andrews, Mr. Thomas Jr  39.00    male         0
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00  female         1
9                          Artagaveytia, Mr. Ramon  71.00    male         0

### Query 4: Select Name, Pclass, and Fare

**Task:** Select Name, Pclass, and Fare columns. Show first 10 rows.

In [5]:
# TODO: Write your query
query_4 = """
SELECT Name, Pclass, Fare
FROM passengers
LIMIT 10

"""

result_4 = pd.read_sql(query_4, conn)
display(result_4)

                                              name  pclass      fare
0                    Allen, Miss. Elisabeth Walton       1  211.3375
1                   Allison, Master. Hudson Trevor       1  151.5500
2                     Allison, Miss. Helen Loraine       1  151.5500
3             Allison, Mr. Hudson Joshua Creighton       1  151.5500
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  151.5500
5                              Anderson, Mr. Harry       1   26.5500
6                Andrews, Miss. Kornelia Theodosia       1   77.9583
7                           Andrews, Mr. Thomas Jr       1    0.0000
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)       1   51.4792
9                          Artagaveytia, Mr. Ramon       1   49.5042

### Query 5: Your Choice!

**Task:** Select ANY 3 columns you want. Show 10 rows. Explain your choice below.

In [7]:
# TODO: Write your query
query_5 = """
SELECT Name, Age, fare
FROM passengers
LIMIT 10
"""

result_5 = pd.read_sql(query_5, conn)
display(result_5)

                                              name    age      fare
0                    Allen, Miss. Elisabeth Walton  29.00  211.3375
1                   Allison, Master. Hudson Trevor   0.92  151.5500
2                     Allison, Miss. Helen Loraine   2.00  151.5500
3             Allison, Mr. Hudson Joshua Creighton  30.00  151.5500
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00  151.5500
5                              Anderson, Mr. Harry  48.00   26.5500
6                Andrews, Miss. Kornelia Theodosia  63.00   77.9583
7                           Andrews, Mr. Thomas Jr  39.00    0.0000
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00   51.4792
9                          Artagaveytia, Mr. Ramon  71.00   49.5042

**Why I chose these columns:** (write your answer here):

Name, age, and fare share the most information and can help when filling in gaps of knowledge.

---

## Part 2: WHERE Clause - Filtering (6 queries)

Practice filtering rows with conditions.

### Query 6: Passengers Over Age 30

**Task:** Find all passengers older than 30. Show Name and Age.

In [8]:
# TODO: Write your query
query_6 = """
SELECT Name, Age
FROM passengers
WHERE Age > 30
"""

result_6 = pd.read_sql(query_6, conn)
print(f"Found {len(result_6)} passengers over 30")
display(result_6.head(10))

Found 437 passengers over 30

                                              name   age
0                              Anderson, Mr. Harry  48.0
1                Andrews, Miss. Kornelia Theodosia  63.0
2                           Andrews, Mr. Thomas Jr  39.0
3    Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0
4                          Artagaveytia, Mr. Ramon  71.0
5                           Astor, Col. John Jacob  47.0
6             Barkworth, Mr. Algernon Henry Wilson  80.0
7  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0
8                            Bazzani, Miss. Albina  32.0
9                             Beattie, Mr. Thomson  36.0

### Query 7: Female Passengers

**Task:** Find all female passengers. Show Name, Age, and Sex. Limit to 10 rows.

In [10]:
# TODO: Write your query (remember: text needs single quotes!)
query_7 = """
SELECT Name, Age, Sex
FROM passengers 
WHERE Sex = 'female'
LIMIT 10
"""

result_7 = pd.read_sql(query_7, conn)
display(result_7)

                                                name   age     sex
0                      Allen, Miss. Elisabeth Walton  29.0  female
1                       Allison, Miss. Helen Loraine   2.0  female
2    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.0  female
3                  Andrews, Miss. Kornelia Theodosia  63.0  female
4      Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0  female
5  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0  female
6                      Aubart, Mme. Leontine Pauline  24.0  female
7                       Barber, Miss. Ellen "Nellie"  26.0  female
8    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0  female
9                              Bazzani, Miss. Albina  32.0  female

### Query 8: First Class Passengers

**Task:** Find all first class passengers (Pclass = 1). Show Name, Pclass, and Fare. Limit to 10.

In [11]:
# TODO: Write your query
query_8 = """
SELECT Name, Pclass, Fare
FROM passengers 
WHERE pclass = 1
LIMIT 10
"""

result_8 = pd.read_sql(query_8, conn)
display(result_8)

                                              name  pclass      fare
0                    Allen, Miss. Elisabeth Walton       1  211.3375
1                   Allison, Master. Hudson Trevor       1  151.5500
2                     Allison, Miss. Helen Loraine       1  151.5500
3             Allison, Mr. Hudson Joshua Creighton       1  151.5500
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  151.5500
5                              Anderson, Mr. Harry       1   26.5500
6                Andrews, Miss. Kornelia Theodosia       1   77.9583
7                           Andrews, Mr. Thomas Jr       1    0.0000
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)       1   51.4792
9                          Artagaveytia, Mr. Ramon       1   49.5042

### Query 9: Survivors

**Task:** Find all passengers who survived (Survived = 1). Show Name, Age, Sex, and Survived. Limit to 15.

In [13]:
# TODO: Write your query
query_9 = """
SELECT Name, Age, Sex, Survived
FROM passengers
WHERE Survived = 1
LIMIT 15
"""

result_9 = pd.read_sql(query_9, conn)
display(result_9)

                                                 name    age     sex  survived
0                       Allen, Miss. Elisabeth Walton  29.00  female         1
1                      Allison, Master. Hudson Trevor   0.92    male         1
2                                 Anderson, Mr. Harry  48.00    male         1
3                   Andrews, Miss. Kornelia Theodosia  63.00  female         1
4       Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00  female         1
5   Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.00  female         1
6                       Aubart, Mme. Leontine Pauline  24.00  female         1
7                        Barber, Miss. Ellen "Nellie"  26.00  female         1
8                Barkworth, Mr. Algernon Henry Wilson  80.00    male         1
9     Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.00  female         1
10                              Bazzani, Miss. Albina  32.00  female         1
11                      Beckwith, Mr. Richard Leonard  37.00    male         1
12   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.00  female         1
13                              Behr, Mr. Karl Howell  26.00    male         1
14                              Bidois, Miss. Rosalie  42.00  female         1

### Query 10: Passengers Who Paid High Fares

**Task:** Find passengers who paid more than $50. Show Name, Fare, and Pclass. Limit to 10.

In [14]:
# TODO: Write your query
query_10 = """
SELECT Name, Fare, Pclass
FROM passengers
WHERE Fare > 50
LIMIT 10
"""

result_10 = pd.read_sql(query_10, conn)
display(result_10)

                                                name      fare  pclass
0                      Allen, Miss. Elisabeth Walton  211.3375       1
1                     Allison, Master. Hudson Trevor  151.5500       1
2                       Allison, Miss. Helen Loraine  151.5500       1
3               Allison, Mr. Hudson Joshua Creighton  151.5500       1
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  151.5500       1
5                  Andrews, Miss. Kornelia Theodosia   77.9583       1
6      Appleton, Mrs. Edward Dale (Charlotte Lamson)   51.4792       1
7                             Astor, Col. John Jacob  227.5250       1
8  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  227.5250       1
9                      Aubart, Mme. Leontine Pauline   69.3000       1

### Query 11: Children (Age 12 or Under)

**Task:** Find children age 12 or under. Show Name and Age. Limit to 10.

In [15]:
# TODO: Write your query
query_11 = """
SELECT Name, Age
FROM passengers
WHERE age < 12
LIMIT 10
"""

result_11 = pd.read_sql(query_11, conn)
display(result_11)

                                  name    age
0       Allison, Master. Hudson Trevor   0.92
1         Allison, Miss. Helen Loraine   2.00
2  Carter, Master. William Thornton II  11.00
3            Dodge, Master. Washington   4.00
4      Spedden, Master. Robert Douglas   6.00
5            Becker, Master. Richard F   1.00
6          Becker, Miss. Marion Louise   4.00
7        Caldwell, Master. Alden Gates   0.83
8     Collyer, Miss. Marjorie "Lottie"   8.00
9       Davies, Master. John Morgan Jr   8.00

---

## Part 3: Multiple Conditions with AND (3 queries)

### Query 12: Female Survivors

**Task:** Find female passengers who survived. Show Name, Age, Sex, and Survived. Limit to 10.

In [17]:
# TODO: Write your query (use AND)
query_12 = """
SELECT Name, Age, Sex, Survived
FROM passengers
WHERE Sex = 'female' AND Survived = 1
LIMIT 10
"""

result_12 = pd.read_sql(query_12, conn)
display(result_12)

                                                name   age     sex  survived
0                      Allen, Miss. Elisabeth Walton  29.0  female         1
1                  Andrews, Miss. Kornelia Theodosia  63.0  female         1
2      Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0  female         1
3  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0  female         1
4                      Aubart, Mme. Leontine Pauline  24.0  female         1
5                       Barber, Miss. Ellen "Nellie"  26.0  female         1
6    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0  female         1
7                              Bazzani, Miss. Albina  32.0  female         1
8   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0  female         1
9                              Bidois, Miss. Rosalie  42.0  female         1

### Query 13: Young Adults (Ages 18-30)

**Task:** Find passengers between age 18 and 30 (inclusive). Show Name and Age. Limit to 15.

**Hint:** You need TWO conditions with AND: `Age >= 18 AND Age <= 30`

In [18]:
# TODO: Write your query
query_13 = """
SELECT Name, Age
FROM passengers
WHERE Age >= 18 AND AGE <= 30
LIMIT 15
"""

result_13 = pd.read_sql(query_13, conn)
display(result_13)

                                                 name   age
0                       Allen, Miss. Elisabeth Walton  29.0
1                Allison, Mr. Hudson Joshua Creighton  30.0
2     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.0
3   Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0
4                       Aubart, Mme. Leontine Pauline  24.0
5                        Barber, Miss. Ellen "Nellie"  26.0
6                            Baxter, Mr. Quigg Edmond  24.0
7                               Behr, Mr. Karl Howell  26.0
8                                   Bird, Miss. Ellen  29.0
9                                 Birnbaum, Mr. Jakob  25.0
10                            Bishop, Mr. Dickinson H  25.0
11            Bishop, Mrs. Dickinson H (Helen Walton)  19.0
12          Bjornstrom-Steffansson, Mr. Mauritz Hakan  28.0
13                            Bonnell, Miss. Caroline  30.0
14                        Bowerman, Miss. Elsie Edith  22.0

### Query 14: Male First Class Survivors

**Task:** Find male passengers in first class who survived. Show Name, Age, Sex, Pclass, Survived. Limit to 10.

**Hint:** THREE conditions with AND!

In [19]:
# TODO: Write your query
query_14 = """
SELECT Name, Age, Sex, Pclass, Survived
FROM passengers
WHERE Sex = 'male' AND Pclass = 1 AND Survived = 1
LIMIT 10
"""

result_14 = pd.read_sql(query_14, conn)
display(result_14)

,name,age,sex,pclass,survived
0,"Allison, Master. Hudson Trevor",0.92,male,1,1
1,"Anderson, Mr. Harry",48.00,male,1,1
2,"Barkworth, Mr. Algernon Henry Wilson",80.00,male,1,1
3,"Beckwith, Mr. Richard Leonard",37.00,male,1,1
4,"Behr, Mr. Karl Howell",26.00,male,1,1
5,"Bishop, Mr. Dickinson H",25.00,male,1,1
6,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",28.00,male,1,1
7,"Blank, Mr. Henry",40.00,male,1,1
8,"Bradley, Mr. George (""George Arthur Brayton"")",NaN,male,1,1
9,"Calderhead, Mr. Edward Pennington",42.00,male,1,1

---

## Part 4: ORDER BY - Sorting (4 queries)

### Query 15: Sort by Age (Youngest First)

**Task:** Show Name and Age, sorted by age from youngest to oldest. Limit to 10.

In [24]:
# TODO: Write your query
query_15 = """
SELECT Name, Age
FROM passengers
ORDER BY age
LIMIT 10
"""

result_15 = pd.read_sql(query_15, conn)
display(result_15)

                                                name   age
0                                Baumann, Mr. John D  None
1      Bradley, Mr. George ("George Arthur Brayton")  None
2                          Brewe, Dr. Arthur Jackson  None
3                              Cairns, Mr. Alexander  None
4  Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...  None
5             Chibnall, Mrs. (Edith Martha Bowerman)  None
6              Chisholm, Mr. Roderick Robert Crispin  None
7                        Clifford, Mr. George Quincy  None
8                          Crafton, Mr. John Bertram  None
9                                 Farthing, Mr. John  None

### Query 16: Sort by Age (Oldest First)

**Task:** Show Name and Age, sorted by age from oldest to youngest. Limit to 10.

**Hint:** Use DESC!

In [25]:
# TODO: Write your query
query_16 = """
SELECT Name, Age
FROM passengers
ORDER BY age DESC
LIMIT 10
"""

result_16 = pd.read_sql(query_16, conn)
display(result_16)

                                                name   age
0               Barkworth, Mr. Algernon Henry Wilson  80.0
1  Cavendish, Mrs. Tyrell William (Julia Florence...  76.0
2                                Svensson, Mr. Johan  74.0
3                            Artagaveytia, Mr. Ramon  71.0
4                          Goldschmidt, Mr. George B  71.0
5                               Connors, Mr. Patrick  70.5
6                       Crosby, Capt. Edward Gifford  70.0
7                        Mitchell, Mr. Henry Michael  70.0
8                                 Straus, Mr. Isidor  67.0
9                              Wheadon, Mr. Edward H  66.0

### Query 17: Sort by Fare (Highest First)

**Task:** Show Name, Fare, and Pclass, sorted by fare from highest to lowest. Limit to 10.

In [26]:
# TODO: Write your query
query_17 = """
SELECT Name, Fare, Pclass
FROM passengers
ORDER BY fare DESC
LIMIT 10
"""

result_17 = pd.read_sql(query_17, conn)
display(result_17)

                                                name      fare  pclass
0                 Cardeza, Mr. Thomas Drake Martinez  512.3292       1
1  Cardeza, Mrs. James Warburton Martinez (Charlo...  512.3292       1
2                             Lesurer, Mr. Gustave J  512.3292       1
3                                   Ward, Miss. Anna  512.3292       1
4                     Fortune, Miss. Alice Elizabeth  263.0000       1
5                         Fortune, Miss. Ethel Flora  263.0000       1
6                         Fortune, Miss. Mabel Helen  263.0000       1
7                     Fortune, Mr. Charles Alexander  263.0000       1
8                                  Fortune, Mr. Mark  263.0000       1
9                Fortune, Mrs. Mark (Mary McDougald)  263.0000       1

### Query 18: Sort by Name (Alphabetical)

**Task:** Show Name, Age, and Sex, sorted alphabetically by name. Limit to 15.

In [28]:
# TODO: Write your query
query_18 = """
SELECT Name, Age, Sex
FROM passengers
ORDER BY Name ASC
"""

result_18 = pd.read_sql(query_18, conn)
display(result_18)

                                               name   age     sex
0                               Abbing, Mr. Anthony  42.0    male
1                     Abbott, Master. Eugene Joseph  13.0    male
2                       Abbott, Mr. Rossmore Edward  16.0    male
3                  Abbott, Mrs. Stanton (Rosa Hunt)  35.0  female
4                       Abelseth, Miss. Karen Marie  16.0  female
...                                             ...   ...     ...
1304  del Carlo, Mrs. Sebastiano (Argenia Genovesi)  24.0  female
1305            van Billiard, Master. James William   NaN    male
1306              van Billiard, Master. Walter John  11.5    male
1307                van Billiard, Mr. Austin Blyler  40.5    male
1308                    van Melkebeke, Mr. Philemon   NaN    male

[1309 rows x 3 columns]

---

## Part 5: Combined Queries (3 challenges)

Put it all together: SELECT, WHERE, ORDER BY, LIMIT

### Query 19: Young Female Survivors

**Task:** Find female passengers under age 20 who survived. Show Name, Age, Sex, Survived. Sort by age (youngest first). Limit to 10.

In [32]:
# TODO: Write your query
query_19 = """
SELECT Name, Age, Sex, Survived
FROM passengers
WHERE sex = 'female' AND age < 20 AND survived = 1
ORDER BY age ASC
LIMIT 10
"""

result_19 = pd.read_sql(query_19, conn)
display(result_19)

                                      name   age     sex  survived
0  Dean, Miss. Elizabeth Gladys "Millvina"  0.17  female         1
1                   Baclini, Miss. Eugenie  0.75  female         1
2            Baclini, Miss. Helene Barbara  0.75  female         1
3                    West, Miss. Barbara J  0.92  female         1
4                    Laroche, Miss. Louise  1.00  female         1
5             Johnson, Miss. Eleanor Ileen  1.00  female         1
6              Nakid, Miss. Maria ("Mary")  1.00  female         1
7          Sandstrom, Miss. Beatrice Irene  1.00  female         1
8                 Quick, Miss. Phyllis May  2.00  female         1
9                 Hirvonen, Miss. Hildur E  2.00  female         1

### Query 20: Wealthy First Class Passengers

**Task:** Find first class passengers who paid more than $100. Show Name, Pclass, Fare. Sort by fare (highest first). Limit to 10.

In [35]:
# TODO: Write your query
query_20 = """
SELECT Name, Pclass, Fare
FROM passengers
WHERE Pclass = 1 AND Fare > 100
ORDER BY fare DESC
LIMIT 10
"""

result_20 = pd.read_sql(query_20, conn)
display(result_20)

                                                name  pclass      fare
0                 Cardeza, Mr. Thomas Drake Martinez       1  512.3292
1  Cardeza, Mrs. James Warburton Martinez (Charlo...       1  512.3292
2                             Lesurer, Mr. Gustave J       1  512.3292
3                                   Ward, Miss. Anna       1  512.3292
4                     Fortune, Miss. Alice Elizabeth       1  263.0000
5                         Fortune, Miss. Ethel Flora       1  263.0000
6                         Fortune, Miss. Mabel Helen       1  263.0000
7                     Fortune, Mr. Charles Alexander       1  263.0000
8                                  Fortune, Mr. Mark       1  263.0000
9                Fortune, Mrs. Mark (Mary McDougald)       1  263.0000

### Query 21: Create Your Own Challenge!

**Task:** Write your own query using:
- SELECT (specific columns)
- WHERE (at least 2 conditions with AND)
- ORDER BY
- LIMIT

Describe what you're looking for: Display all young men under 20 in 1st class, who survived. Then order the set by fare (largest first) and limit by 15

**My query finds:** (describe here)

In [39]:
# TODO: Write your creative query!
query_21 = """
SELECT Name, Age, Pclass, Survived, Sex, Fare
FROM passengers
WHERE Sex = 'male' AND Age < 20 AND Pclass = 1 AND survived = 1
ORDER BY Fare DESC
"""

result_21 = pd.read_sql(query_21, conn)
display(result_21)

,name,age,pclass,survived,sex,fare
0,"Ryerson, Master. John Borie",13.00,1,1,male,262.3750
1,"Allison, Master. Hudson Trevor",0.92,1,1,male,151.5500
2,"Spedden, Master. Robert Douglas",6.00,1,1,male,134.5000
3,"Carter, Master. William Thornton II",11.00,1,1,male,120.0000
4,"Thayer, Mr. John Borland Jr",17.00,1,1,male,110.8833
5,"Dodge, Master. Washington",4.00,1,1,male,81.8583

---

## Reflection Questions

Answer these questions in the markdown cells below:

### Question 1: SQL vs. pandas

**How is writing WHERE in SQL similar to filtering in pandas? How is it different?**

*Your answer here:* While, both of them are used to filter data, pandas is a little bit more complicated.

### Question 2: ORDER BY

**When would you use ORDER BY ASC vs. ORDER BY DESC? Give a real-world example for each.**

*Your answer here:*
When you want the data to show the lowest first, you use ASC. When you want the highest first, you use desc. If you were looking for the lowest fare of 1st class riders, you could order by asc to find the lowest on top. Vice versa for descending. If you wanted to find the most expensive product of a catalog, you could use desc on price.

### Question 3: Most Challenging

**Which query was hardest for you? Why? How did you figure it out?**

*Your answer here:*
Order by because I forgot it has a space and isnt one word.

---

## Clean Up

In [40]:
# Close database connection
conn.close()
print("âœ… Connection closed. Great work!")

âœ… Connection closed. Great work!

---

## âœ… Before You Submit

Make sure you:
- [ ] Completed all 21 queries
- [ ] Answered all reflection questions
- [ ] Tested that all cells run without errors
- [ ] Used proper SQL syntax (SELECT â†’ FROM â†’ WHERE â†’ ORDER BY â†’ LIMIT)
- [ ] Put single quotes around text values
- [ ] Saved your file

**Submit via GitHub:** `databaseApplications/dbApps04_Task_TrackA.ipynb`

**Great work!** You've learned SQL basics! ðŸŽ‰